/***********************************************************************//**
	@file
***************************************************************************/
#pragma once

#include "ump/thread/Condition.hpp"

namespace ump {
namespace thread {
/***********************************************************************//**
	@brief スレッド
***************************************************************************/
class Thread {
 private:
  std::unique_ptr<std::thread> thread_;
  Condition cond_;

 public:
  Thread() = default;
  ~Thread();

  void start(std::thread* thread);
  void stop();
  bool isStop() const;
  bool sleep(int ms);
};
/***********************************************************************//**
	$Id$
***************************************************************************/
}
}
